---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CharactersNotAllowed
source: html/6ac17a38-aec3-d173-c26e-030b66b09d7a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CharactersNotAllowed Property

Name cannot contain any of the following characters:\n[{}[]|;<>?`~]\nor any of the non-printable characters.

## Syntax (C#)
```csharp
public static FailureDefinitionId CharactersNotAllowed { get; }
```